WS_SOAP_Java_Client/src/main/resources/wsdl/RpcLitWrap/RpcLitWrap_Params_ServiceClassService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is JAX-WS RI 2.1.6 in JDK 6. -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://wrap.lit.rpc.service.ws.pg.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://wrap.lit.rpc.service.ws.pg.com/"
	name="RpcLitWrap_Params_ServiceClassService">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://wrap.lit.rpc.service.ws.pg.com/"
				schemaLocation="./RpcLitWrap_Params_ServiceClassService.xsd"></xsd:import>
		</xsd:schema>
	</types>
	<message name="createUser">
		<part name="arg0" type="xsd:string"></part>
		<part name="arg1" type="xsd:int"></part>
		<part name="arg2" type="xsd:double"></part>
	</message>
	<message name="createUserResponse">
		<part name="return" type="tns:userBo"></part>
	</message>
	<portType name="RpcLitWrap_Params_ServiceClass">
		<operation name="createUser" parameterOrder="arg0 arg1 arg2">
			<input message="tns:createUser"></input>
			<output message="tns:createUserResponse"></output>
		</operation>
	</portType>
	<binding name="RpcLitWrap_Params_ServiceClassPortBinding" type="tns:RpcLitWrap_Params_ServiceClass">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="rpc"></soap:binding>
		<operation name="createUser">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal" namespace="http://wrap.lit.rpc.service.ws.pg.com/"></soap:body>
			</input>
			<output>
				<soap:body use="literal" namespace="http://wrap.lit.rpc.service.ws.pg.com/"></soap:body>
			</output>
		</operation>
	</binding>
	<service name="RpcLitWrap_Params_ServiceClassService">
		<port name="RpcLitWrap_Params_ServiceClassPort" binding="tns:RpcLitWrap_Params_ServiceClassPortBinding">
			<soap:address
				location="http://localhost:6002/rpclitwrapparam/RpcLitWrap_Params_ServiceClassService"></soap:address>
		</port>
	</service>
</definitions>